//  Задайте двумерный массив размером m×n, заполненный случайными вещественными числами.
Console.WriteLine("Введите число строк двумерного массива")